# Перший студент має створити текстовий файл,
# у який програмно записати кілька рядків - своє прізвище та питання з програмування мовою Python,
# відповідь на яке має надати другий студент.
# У програмному коді реалізувати обробку виключних ситуацій по роботі з файлами.
# Другий студент повинен програмно записати у файл своє прізвище,
# розгорнуту відповідь на питання - текст до кількох рядків,
# а також поставити питання, на яке повинен відповісти третій студент і т.д.
#
# Усі дії над файлом слід виконувати програмно.
#
# Усі студенти повинні працювати з текстовим файлом, який розмістив перший студент.
# За основу можна брати програмний код, написаний попереднім студентом, у програмному коді коментарі обов'язкові.
#
# У результаті виконання завдань усіма студентами має бути один програмний код,
# у якому у коментарях до частин програмного коду вказати прізвища студентів, які їх писали.

def task6():
    # KarinaChernobai start

    try:
        # створюємо файл
        with open('docs/task6.txt', 'w', encoding='utf-8') as f:
            f.write('Чорнобай\n')
            # записуємо питання
            f.write('Python — мова, що інтерпретується чи компілюється?')
    except FileNotFoundError as e:
        # обробляємо помилки
        print(f"File {e.filename} cannot be created.")

    # KarinaChernobai end

    return
